#+title: macbook pro (11,3) trackpad with ubuntu (15.10)
# org-publish options
# H:2   controls section numbering.  
#       number top-level and second-level headings only
# ^:{}  require a_{b} before assuming that b should be subscripted.  
#       without this option a_b will automatically subscript b.
#+options: ^:{}
#
# options used exclusively by emacs
#+startup: showall
#
# options used exclusively by the html exporter
#+language: en
#+infojs_opt: view:showall mouse:#ffc0c0 toc:nil ltoc:nil path:/ext/org/org-info.js
#+html_head: <link rel="stylesheet" type="text/css" href="css/notebook.css" />
#+html_link_home: index.html
#+html_link_up: index.html

* Introduction

  I installed ubuntu 15.10 (wily werewolf) on my late 2014 macbook pro (MacBookPro 11,3).
  The trackpad behavior was immediately highly annoying. 
  The main problem was lots of false positives -- the driver deciding I
  wanted to use the trackpad while typing,  when my palm gently brushed it.

  I managed to solve the problem by using the 'mtrack' driver.
  I think this is replacing the default synaptics driver for trackpad input.

** References
   - http://www.chris-reilly.org/blog/technotes/macbook-trackpad-in-ubuntu
   - http://yarenty.blogspot.com/2014/08/how-to-fix-macbook-pro-touchpad-on.html
   - [[https://github.com/BlueDragonX/xf86-input-mtrack/blob/master/README.md]]

   - source :: .org mode source for this page is here: file:mac-trackpad-ubuntu-src.org

* Instructions

** install the xorg mtrack ubuntu package:
   #+begin_example
   sudo apt-get install xserver-xorg-input-mtrack
   #+end_example
   This installs the following files:
   #+begin_src sh :exports both
   dpkg-query -L xserver-xorg-input-mtrack
   #+end_src

   #+RESULTS:
   | /.                                                           |
   | /usr                                                         |
   | /usr/lib                                                     |
   | /usr/lib/xorg                                                |
   | /usr/lib/xorg/modules                                        |
   | /usr/lib/xorg/modules/input                                  |
   | /usr/lib/xorg/modules/input/mtrack_drv.so                    |
   | /usr/share                                                   |
   | /usr/share/bug                                               |
   | /usr/share/bug/xserver-xorg-input-mtrack                     |
   | /usr/share/X11                                               |
   | /usr/share/X11/xorg.conf.d                                   |
   | /usr/share/X11/xorg.conf.d/50-mtrack.conf                    |
   | /usr/share/doc                                               |
   | /usr/share/doc/xserver-xorg-input-mtrack                     |
   | /usr/share/doc/xserver-xorg-input-mtrack/copyright           |
   | /usr/share/doc/xserver-xorg-input-mtrack/README.md.gz        |
   | /usr/share/doc/xserver-xorg-input-mtrack/changelog.Debian.gz |
   | /usr/share/bug/xserver-xorg-input-mtrack/script              |

** install mtrack configuration file
   #+begin_example
   sudo mkdir -p /etc/X11/xorg.conf.d
   rsync -a -v /usr/share/X11/xorg.conf.d/50-mtrack.conf /etc/X11/xorg.conf.d
   #+end_example

** choose trackpad settings
   I used Chris Reilly's settings:
#+include: "/etc/X11/xorg.conf.d/50-mtrack.conf" example


